TP1_maven/src/wsdl/istp1service.azurewebsites.net/LoginService.svc.wsdl_wsdl0.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions targetNamespace="http://ISTP1.Service.Contracts.Service" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://ISTP1.Service.Contracts.Service" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsdl:types><xsd:schema targetNamespace="http://ISTP1.Service.Contracts.Service/Imports"><xsd:import schemaLocation="http://istp1service.azurewebsites.net/LoginService.svc?xsd=xsd0" namespace="http://ISTP1.Service.Contracts.Service"/><xsd:import schemaLocation="http://istp1service.azurewebsites.net/LoginService.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="http://istp1service.azurewebsites.net/LoginService.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data"/></xsd:schema></wsdl:types><wsdl:message name="ILoginService_SolicitarAutorizacion_InputMessage"><wsdl:part name="parameters" element="tns:SolicitarAutorizacion"/></wsdl:message><wsdl:message name="ILoginService_SolicitarAutorizacion_OutputMessage"><wsdl:part name="parameters" element="tns:SolicitarAutorizacionResponse"/></wsdl:message><wsdl:portType name="ILoginService"><wsdl:operation name="SolicitarAutorizacion"><wsdl:input wsaw:Action="http://ISTP1.Service.Contracts.Service/ILoginService/SolicitarAutorizacion" message="tns:ILoginService_SolicitarAutorizacion_InputMessage"/><wsdl:output wsaw:Action="http://ISTP1.Service.Contracts.Service/ILoginService/SolicitarAutorizacionResponse" message="tns:ILoginService_SolicitarAutorizacion_OutputMessage"/></wsdl:operation></wsdl:portType></wsdl:definitions>